ObschepitRAIPO/src/Documents/ФормированиеНарядЗаказа/ФормированиеНарядЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеНарядЗаказа</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выход</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ObschepitRAIPO/src/Documents/ФормированиеНарядЗаказа/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЦенаБлюда");
	СтрокаТабличнойЧастиВыход = Строка(ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЗначениеВеса"));
	СтрокаТабличнойЧастиВыходЕдиницаИзмерения = Строка(ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЕдиницаИзмерения"));
	СтрокаТабличнойЧасти.Выход = СтрокаТабличнойЧастиВыход + СтрокаТабличнойЧастиВыходЕдиницаИзмерения;
КонецПроцедуры
#КонецОбласти
